Revit 2024 API
ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeDeterminationParam Property
 "Building Envelope"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeDeterminationParam { get; }
Visual Basic
Public Shared ReadOnly Property RbsEnergyAnalysisBuildingEnvelopeDeterminationParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsEnergyAnalysisBuildingEnvelopeDeterminationParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace